In [1]:
import pandas as pd
import numpy as npp
from sqlalchemy import create_engine

# Questão 1

## Carregando os dados para um banco de dados SQL

In [2]:
%load_ext sql
%sql mysql+pymysql://root:12345@localhost/q1
engine = create_engine('mysql+pymysql://root:12345@localhost/q1')

In [3]:
data = pd.read_csv('Questão 1 - Base.txt', delimiter = "\t", parse_dates=['DT_VENCIMENTO'])
data.to_sql('fatura', con = engine, index = False)

## 1.1  – Qual o percentual de faturas emitidas por mês no qual os clientes não pagaram a fatura anterior?

In [5]:
%%sql
SELECT MONTH(DT_VENCIMENTO)AS Mês,
(COUNT(case when DS_ROLAGEM= 'FX1' then 1 end)/COUNT(*)*100) AS '%_de_faturas_FX1' FROM fatura
GROUP BY Mês
ORDER BY Mês;

 * mysql+pymysql://root:***@localhost/q1
9 rows affected.

[(1, Decimal('7.2866')),
 (2, Decimal('8.8985')),
 (3, Decimal('10.8786')),
 (4, Decimal('8.3948')),
 (5, Decimal('10.0446')),
 (6, Decimal('8.5348')),
 (7, Decimal('9.6139')),
 (8, Decimal('9.0631')),
 (9, Decimal('8.5369'))]

## 1.2 – Tendo como referência todos os clientes que tiveram fatura emitida no mês de setembro, gere uma base para esses clientes com os seguintes calculados:

• Total de faturas emitidas nos últimos 6 meses (sem contar com a fatura de setembro);

• O valor médio de fatura nos últimos 6 meses (sem contar com a fatura de setembro);

• Quantidade de vezes que ele ficou sem pagar a fatura anterior nos últimos 6 meses (sem contar com a fatura de setembro).

In [6]:
%%sql
DROP TABLE IF EXISTS base;
CREATE TABLE base AS
SELECT ID_CONTA, AVG(VL_FATURA) as VL_MEDIO_FATURA, COUNT(*) as TOTAL_DE_FATURAS_ULT_6M,
COUNT(case when DS_ROLAGEM= 'FX1' then 1 end) AS QNT_FATURAS_ULT_6M_FX1  FROM fatura
WHERE MONTH(DT_VENCIMENTO) < 9 AND MONTH(DT_VENCIMENTO) > 2
GROUP BY ID_CONTA
HAVING ID_CONTA IN (SELECT ID_CONTA FROM fatura WHERE MONTH(DT_VENCIMENTO) = 9)

 * mysql+pymysql://root:***@localhost/q1
0 rows affected.
240242 rows affected.

[]

In [7]:
#Mostrando a base criada
%sql SELECT * FROM base LIMIT 10

 * mysql+pymysql://root:***@localhost/q1
10 rows affected.

[(1624902, 424.06, 4, 0),
 (1624908, 1188.2016666666666, 6, 2),
 (1624916, 686.9883333333333, 6, 0),
 (1624951, 179.85833333333335, 6, 0),
 (1624975, 82.58999999999999, 4, 0),
 (1624992, 407.59999999999997, 6, 0),
 (1625050, 787.5500000000001, 6, 1),
 (1625052, 448.4183333333333, 6, 1),
 (1625058, 461.18833333333333, 6, 2),
 (1625068, 202.76833333333335, 6, 0)]

## Salvando a base em arquivo txt

In [8]:
base = %sql SELECT * FROM base

 * mysql+pymysql://root:***@localhost/q1
240242 rows affected.

In [9]:
base.DataFrame().to_csv('base.txt', sep ='\t', index = False)